a5021/STM32F401CCU6-Blink-Bare-Metal/inc/main.h
  GPIOA->PUPDR = (
#ifndef SWD_DISABLED
    PIN_CONF(PIN(14), PIN_PULL_UP)      | /* PA14 AF0 -- SYS_SWDCLK           */
    PIN_CONF(PIN(13), PIN_PULL_DOWN)    | /* PA13 AF0 -- SYS_SWDIO            */
#endif
    PIN_CONF(PIN(1),  PIN_PULL_UP)        /* PA1  INPUT PULL-UP               */
  );

  SW_PIN(C, PIN_HIGH(13));                /* SET GPIOC PIN 13 HIGH            */

  GPIOC->MODER = ALL_ANALOG - (           /* Configure GPIOC                  */
    PIN_CONF(PIN(13), PINV_OUTPUT)        /* PA13 OUTPUT PUSH-PULL            */
  );
}

__STATIC_INLINE void init_usart(uint32_t baudrate) {
  USART6->BRR = UART_BAUDRATE(100 MHZ, baudrate);
  USART6->CR1 = (
    0 * USART_CR1_SBK        | /* 0x00000001 Send Break                             */
    0 * USART_CR1_RWU        | /* 0x00000002 Receiver wakeup                        */
    0 * USART_CR1_RE         | /* 0x00000004 Receiver Enable                        */
    1 * USART_CR1_TE         | /* 0x00000008 Transmitter Enable                     */
    0 * USART_CR1_IDLEIE     | /* 0x00000010 IDLE Interrupt Enable                  */
    0 * USART_CR1_RXNEIE     | /* 0x00000020 RXNE Interrupt Enable                  */
    0 * USART_CR1_TCIE       | /* 0x00000040 Transmission Complete Interrupt Enable */
    0 * USART_CR1_TXEIE      | /* 0x00000080 TXE Interrupt Enable                   */
    0 * USART_CR1_PEIE       | /* 0x00000100 PE Interrupt Enable                    */
    0 * USART_CR1_PS         | /* 0x00000200 Parity Selection                       */
    0 * USART_CR1_PCE        | /* 0x00000400 Parity Control Enable                  */
    0 * USART_CR1_WAKE       | /* 0x00000800 Wakeup method                          */
    0 * USART_CR1_M          | /* 0x00001000 Word length                            */
    1 * USART_CR1_UE         | /* 0x00002000 USART Enable                           */
    0 * USART_CR1_OVER8        /* 0x00008000 USART Oversampling by 8 enable         */
  );
}

#if defined(__clang__) && !defined(__CC_ARM)
  #pragma clang diagnostic ignored "-Wextra-semi-stmt"
#elif defined(__CC_ARM)
    #pragma diag_suppress 1293
#endif

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
